nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/demo_apps/mc_pmsm/pmsm_enc/pin_mux.h
/*
    * Copyright 2024 NXP
    *
    * SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOF7 (number 59), LED_G
  @{ */
#define BOARD_INITPINS_LED_G_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_INITPINS_LED_G_PIN 7U              /*!<@brief GPIOF pin index: 7 */
#define BOARD_INITPINS_LED_G_PIN_MASK kGPIO_Pin7 /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name GPIOF6 (number 58), LED_R
  @{ */
#define BOARD_INITPINS_LED_R_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_INITPINS_LED_R_PIN 6U              /*!<@brief GPIOF pin index: 6 */
#define BOARD_INITPINS_LED_R_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name GPIOC13 (number 49), SW5
  @{ */
#define BOARD_INITPINS_SW5_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_SW5_PIN 13U              /*!<@brief GPIOC pin index: 13 */
#define BOARD_INITPINS_SW5_PIN_MASK kGPIO_Pin13 /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name GPIOF4 (number 41), LED_B
  @{ */
#define BOARD_INITPINS_LED_B_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_INITPINS_LED_B_PIN 4U              /*!<@brief GPIOF pin index: 4 */
#define BOARD_INITPINS_LED_B_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name GPIOF5 (number 42), LED_Y
  @{ */
#define BOARD_INITPINS_LED_Y_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_INITPINS_LED_Y_PIN 5U              /*!<@brief GPIOF pin index: 5 */
#define BOARD_INITPINS_LED_Y_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
